Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: ཁྱོད་ཀྱིས་གང་གི་ཚེ་སྤྲེའུ་རྣམས་ཚོགས་པར་གྱུར་པ་དེའི་ཚེ་ཁོ་བོ་ཅག་ལ་སྦྲོན་ཅིག །དེ་ནས་དུས་གཞན་ཞིག་ན་ཤིང་ཏིན་ཏུ་ཀའི་མེ་ཏོག་དང་འབྲས་བུ་ཆགས་ཏེ་སྨིན་པ་དང་། སྤྲེའུ་རྣམས་ཀྱིས་སྡེ་དཔོན་ལ་སྨྲས་པ།
en: They set a lookout and instructed him, ‘You should let us know when the monkeys have gathered.’ “Sometime after that, the persimmon tree bloomed and its fruit became ripe. The monkeys said to their leader, ‘O Leader, the persimmons are ripe;

source: སྡེ་དཔོན་ཤིང་ཏིན་ཏུ་ཀ་སྨིན་ཅིང་མཆིས་ཀྱིས་གསོལ་དུ་གཤེགས་སོ།
en: let’s go eat them.’

source: །དེ་ནས་སྡེ་དཔོན་འཁོར་ལྔ་བརྒྱ་དང་ཤིང་ཏིན་ཏུ་ཀ་ལ་འཛེགས་ཏེ་ཤིང་ཏིན་ཏུ་ཀ་དེ་ལ་བཟའ་བར་བརྩམས་སོ། །དེ་ནས་སྲུང་མའི་མིས་རི་བྲགས་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ལ་སྨྲས་པ།
en: “Thereupon the leader, with five hundred attendants, climbed the persimmon tree and started to eat the persimmons.

source: ཤེས་ལྡན་དག་ཤིང་ཏིན་ཏུ་ཀ་ལ་སྤྲེའུ་ཐམས་ཅད་འཛེགས་ནས་ཟ་བར་བྱེད་ཀྱིས་ཁྱེད་ཅག་གི་བྱ་བའམ་བྱེད་པ་གང་ཡིན་པ་དེ་གྱིས་ཤིག །དེ་ནས་རི་བྲགས་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ལག་ན་མདའ་གཞུ་དང་དགྲ་སྟ་ཐོགས།
en: Then the lookout said to the people dwelling in the hamlet, ‘Sirs, all the monkeys have climbed the persimmon tree and are eating. Get on with your business; do what should be done.’

source: ཁུ་ཚུར་བཅངས་ཏེ་རིངས་པར་སོང་ནས་ཤིང་ཏིན་ཏུ་ཀ་བཅད་པར་བརྩམས་པ་དང་། དེ་ནས་སྤྲེའུ་དེ་རྣམས་བྲེད་དེ་མཆོང་རྒལ་ཞིང་ཤིང་ཀ་ཕན་ཚུན་རྒྱུ་བར་བྱེད་དོ།
en: “Thereupon the people dwelling in the hamlet hurried there, holding sticks and bows in their hands and clenching their fists, and started to cut down the persimmon tree.

source: །སྡེ་དཔོན་ནི་སེམས་ལས་ཆུང་ངུས་ཟ་བར་བྱེད་པ་དང་། སྤྲེའུ་དེ་རྣམས་ཀྱིས་དེ་ལ་སྨྲས་པ།
en: Being scared, the monkeys jumped to and fro on the branches, but the leader kept eating, unconcerned.

source: སྡེ་དཔོན་བདག་ཅག་ནི་སྡུག་བསྔལ་མི་བཟད་པ་ཉམ་ང་བ་ཐོབ་ཅིང་མཆིས་ཏེ་ཕན་ཚུན་དུ་རྒྱུ་ལགས་ན། ཁྱོད་ཅིའི་སླད་དུ་ཐུགས་ཁྲལ་ཆུང་ངུས་བཞུགས་དེས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The monkeys asked him, ‘O Leader, while we are experiencing intolerable pain and fear and are jumping to and fro, why are you unconcerned?’ “He spoke a verse:

source: བྱ་བ་མང་པོའི་མི་རྣམས་ལ། །བྱ་བ་མིན་པའང་དེ་དང་འདྲ།
en: “ ‘For those who have many things to do, there are also many things not to do.

source: །ཤིང་གི་འཕྲོ་ནི་མང་ཡོད་པས།
en: Since there remains much of the tree,

source: །སེམས་ལས་བསྐྱུངས་ཏེ་བཟའ་བར་གྱིས།
en: Leave your worries behind and eat.’

source: །དེ་ནས་ཡང་སྡེ་དཔོན་གྱི་ཕྲུ་གུ་ཞིག་རི་བྲགས་དེ་ན་བཅིངས་ཏེ་འདུག་པ་དེ་ལག་པ་འགྲམ་པ་ལ་གཏད་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་པ་དང་། ཇི་ཙམ་ན་སྤྲེའུ་བཟང་པོ་ཞིག་ཕྱོགས་དེར་འོངས་པ་དང་། དེ་སེམས་ཁོང་དུ་ཆུད་པ་མཐོང་ནས་སྨྲས་པ། གྲོགས་པོ་ཅིའི་ཕྱིར་ལག་པ་འགྲམ་པ་ལ་གཏད་ནས་སེམས་ཁོང་དུ་ཆུད། དེས་སྨྲས་པ།
en: “Meanwhile a son of the leader had been kept tied up in the hamlet. He was plunged into grief, resting his cheek on his hand. Then a good monkey came and saw him plunged into grief and asked, ‘O my friend, why are you plunged into grief, resting your cheek on your hand?’ “He answered, ‘Now all the people have gone to kill my family.

source: ད་ལྟར་རི་བྲགས་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ཁོ་བོའི་ཉེ་དུ་གསོད་དུ་དོང་ན་ཅིའི་ཕྱིར་སེམས་ཁོང་དུ་ཆུད་པར་མི་འགྱུར།
en: How can I help being plunged into grief?’

source: ཅིའི་ཕྱིར་ཁྱོད་ཀྱིས་ཕ་རོལ་གནོན་པ་མ་བྱས།
en: “ ‘Why do you not drive them back?’

source: བཅིངས་ན་ཇི་ལྟར་ཕ་རོལ་གནོན་པ་བྱ།
en: “ ‘How could I do that, tied up as I am?’

source: ཁོ་བོས་ཁྱོད་དགྲོལ་ལོ་ཞེས་དེས་དེ་བཀྲོལ་བ་དང་། དེ་ནས་དེས་རི་བྲགས་དེར་མེ་བཏང་སྟེ།
en: “ ‘I will release you.’ “The good monkey then did release him. Thereupon he set fire to the hamlet, burning it down entirely.

source: རི་བྲགས་ཀུན་ཚིག་པས་ཅ་ཅོ་དང་ཀུ་ཅོའི་སྒྲ་ཆེན་པོ་བྱུང་བ་དེ་རྣམས་ཀྱིས་ཐོས་ནས་སྔངས་ཏེ་སྨྲས་པ།
en: Great cries and a clamor rose up.

source: ཤེས་ལྡན་དག་བདག་ཅག་དང་སྤྲེའུ་རྣམས་ནི་ཐག་རིང་པོ་ཁོ་ན་ཡིན་གྱི།
en: The people became frightened when they heard all that and said, ‘Sirs, the monkeys are quite far away from us;

source: ཕུང་བ་ཆེན་པོ་གཞན་འདི་བྱུང་སྟེ་རི་བྲགས་བསྲེགས་ཀྱིས་མེ་གསད་ཀྱིས་སླར་ལྡོག་གོ་ཞེས་དེ་རྣམས་མེ་གསད་པའི་ཕྱིར་བརྒྱུགས་པ་དང་། སྤྲེའུ་རྣམས་ཀྱང་ཤིང་ཏིན་ཏུ་ཀ་ལས་བབས་ནས་བྲོས་སོ།
en: there is another great disaster right here. Since the hamlet is burning, let’s turn back to extinguish the fire.’ “They ran to extinguish the fire, and the monkeys climbed down the persimmon tree and ran away.

source: སྤྲེའུའི་ཕྲུ་གུ་གང་ཡིན་པ་དེ་ནི་ཤཱཀྱ་རྒན་པོ་འདི་ཉིད་ཡིན་ཏེ།
en: That one who was the monkey’s son is this old man from the Śākya clan.

source: དེ་ན་ཡང་འདིས་ཉེ་དུ་ལ་ཆགས་པས་རི་བྲགས་བསྲེགས་ལ་ད་ལྟར་ཡང་འདིས་ཉེ་དུ་ལ་ཆགས་པས་རི་བྲགས་བསྲེགས་སོ།
en: He then burned the hamlet out of attachment to his relatives. Now, too, he has burned a hamlet out of attachment to his relatives.” IX. The City of Kāla

source: །ནག་པོའི་གྲོང་ཁྱེར་དུ་གཤེགས་ནས་ནག་པོའི་གྲོང་ཁྱེར་དུ་སངས་རྒྱས་བཞིའི་གདན་ཞེས་བྱ་བ་རྒྱས་པར་གོང་མ་བཞིན་དུའོ།
en: The Blessed One arrived at the city of Kāla.

source: །རོ་ཧི་ཏ་ཀར་བྱོན་ནས་རོ་ཧི་ཏ་ཀ་ན་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ཀྱི་གནས་ན་བཞུགས་སོ།
en: In the city of Kāla, . . . (the phrase about the seat of four buddhas should be recited in detail) . . . . X. Rohitaka A. Offerings of the Yakṣa Elephant Power The Blessed One arrived in Rohitaka and stayed near the residence of the yakṣa Elephant Power. At that time the yakṣa Elephant Power was away at a meeting of yakṣas.

source: །དེའི་ཚེ་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་གནོད་སྦྱིན་རྣམས་ཀྱི་གནོད་སྦྱིན་གྱི་འདུན་སར་སོང་བ་དང་། གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ཀྱིས། བཅོམ་ལྡན་འདས་བསྐྱེད་པར་བྱོན་ནས་རོ་ཧི་ཏ་ཀ་ན་བདག་གི་གནས་ཁོ་ན་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ།
en: When the yakṣa Elephant Power heard that the Blessed One had arrived and was staying near his very residence in Rohitaka, he went to the Blessed One.

source: །ཐོས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Upon his arrival, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད་ཅེས་བྱ་བ་ནས།
en: When he had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed, inspired, . . . .

source: ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When he had . . . delighted him . . . , the Blessed One remained silent.

source: །དེ་ནས་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དོ་མོད་བདག་གི་གནས་སུ་བཞུགས་པར་གནང་བར་མཛད་དུ་གསོལ།
en: Thereupon the yakṣa Elephant Power rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One assent to stay in my residence today.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to the yakṣa Elephant Power by remaining silent.

source: །དེ་ནས་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་སྤྲུལ་ཏེ། སྟན་ནང་ཚངས་ཅན་དང་། སྔས་ནང་ཚངས་ཅན་དང་། གོར་བུ་ལྔ་བརྒྱ་དང་། ཞུགས་ལིང་ལྔ་བརྒྱ་བཤམས་སོ།
en: Thereupon the yakṣa Elephant Power magically created five hundred monasteries and prepared five hundred cushions, pillows, and square blankets, along with five hundred hearths.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: He then said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.”

source: །དེ་ནས་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ཀྱིས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ནས་དེའི་ནེའུ་ཟླ་ཁ་ཆེ་ཡུལ་གྱི་གནོད་སྦྱིན་སྒྲ་སྒྲོགས་ཞེས་བྱ་བ་དེ་ལ་དེས་བསྒོ་བ།
en: The yakṣa Elephant Power, knowing that the Blessed One had assented by remaining silent, rose from his seat and departed. He then made a request of a friend of his named Guṃjika, a yakṣa of the country of Kaśmīra:

source: ཁོ་བོས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་ཀྱིས་བྱང་ཕྱོགས་ཀྱི་འབྲས་བུ་རྣམས་སྐུར་ཅིག་ཅེས་དེས་དེ་ལ་ཕོ་ཉ་བཏང་ནས་དེ་ཉིད་ཀྱི་མཚན་མོ་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་བྱས་ནས།
en: “Since I have invited the community of monks headed by the Buddha to a meal, please send me fruits of the northern region.” After sending a messenger to Guṃjika, he prepared a pure and fine meal during the night.

source: ནང་པར་སྔར་ལངས་ཏེ་གཙུག་ལག་ཁང་ཆག་ཆག་དང་ཕྱག་དར་བྱས་ནས་གདན་བཤམས་ཏེ་ནོར་བུའི་ཆུ་སྣོད་བཞག་ནས།
en: After he rose at dawn, he sprinkled and swept the inside of the monastery, prepared seats, and set up a jeweled pitcher.

source: ཁང་སྐྱོང་གིས་གཎྜཱི་བརྡུངས་པ་དང་། གནོད་སྦྱིན་སྒྲ་སྒྲོགས་ཀྱིས་རྒུན་འབྲུམ་གྱིས་སྐོན་པ་བཀང་སྟེ་གནོད་སྦྱིན་རྣམས་ཀྱི་ལག་ཏུ་བསྐུར་ཏེ། དེ་དག་གིས་གཙུག་ལག་ཁང་གི་དབུས་སུ་ཕུང་པོར་སྤུངས་ཏེ་བཞག་གོ།
en: When the monastery keeper struck the gong, the yakṣa Guṃjika filled baskets with grapes and had yakṣas bring them. They piled the grapes up in the middle of the monastery.

source: །དགེ་སློང་རྣམས་ཀྱིས་འབྲས་བུ་འདི་དག་ཅིའི་ཡིན་པ་དང་། ཇི་ལྟར་བརྟག་པར་བྱ་བ་མི་ཤེས་ནས།
en: The monks knew neither what these fruits were nor how to make them suitable to consume.

source: དེ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་བྱང་ཕྱོགས་ཀྱི་ནགས་ཀྱི་འབྲས་བུ་རྒུན་འབྲུམ་ཞེས་བྱ་སྟེ།
en: They asked the Blessed One, and the Blessed One said, “Monks, these are fruits from forests in the northern region that are called grapes.

source: མེས་བརྟག་པ་བྱོས་ལ་རིམ་ཤིག །དགེ་སློང་རྣམས་འབྲུམ་བུ་རེ་རེ་ནས་བྱེད་པ་ན་ཤིན་ཏུ་ཡུན་རིང་དུ་ཐོགས་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Make them suitable to consume through fire and distribute them.” When the monks started to do so with each grape, it took them an extremely long time.

source: ཕུང་པོ་གཉིས་སམ་གསུམ་དུ་བྱོས་ལ་མེས་རེག་པར་བྱོས་ཤིག །དེ་ནས་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ཀྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས།
en: The Blessed One instructed them, “Make them into two or three groups and have the groups touched by fire.”

source: གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་ཞེས་བྱ་བ་ནས།
en: The yakṣa Elephant Power then knew that the community of monks headed by the Buddha had sat down in comfort, and with his own hands he served and satisfied them with a pure and fine meal . . . .

source: སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆོས་མཉན་པའི་ཕྱིར་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: He took a low seat and sat before the Blessed One in order to hear the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གླང་ཆེན་སྟོབས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་པ་དང་རྒུན་འབྲུམ་མང་དུ་ལྷག་པར་གྱུར་ནས།
en: The Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted the yakṣa Elephant Power, and then rose from his seat. Many grapes were left.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒུན་འབྲུམ་རྣམས་མཉེས་ལ་ཁུ་བ་བྲིམ་པར་བྱའོ།
en: The Blessed One said, “You should squeeze the grapes and distribute the juice.”

source: །འོན་ཀྱང་ལྷག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Some juice was still left. The Blessed One said, “Heat it and keep it.

source: དྲོ་འཇར་བྱས་ཏེ་བཞག་པ་དང་དགེ་འདུན་གྱི་དུས་མ་ཡིན་པའི་བཏུང་བར་འགྱུར་རོ།
en: It will be the community’s drink to be consumed at night.” B.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གཙུག་ལག་ཁང་གི་ཕྱི་རོལ་དུ་ཞབས་གཉིས་བཀྲུས་ནས་གཙུག་ལག་ཁང་དུ་ནང་དུ་ཡང་དག་འཇོག་གི་ཕྱིར་ཞུགས་སོ།
en: Departure to the Northern Region After that, the Blessed One washed his feet outside the monastery and entered the monastery to go into seclusion.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། ང་ནི་ཚེ་ཐུང་ངུའི་དུས་ལ་བྱུང་བས་མྱ་ངན་ལས་འདས་པའི་དུས་ལ་བབ་ན་གདུལ་བའི་དོན་བྱ་བ་ནི་རབ་ཏུ་མང་བས་གལ་ཏེ་ང་དགེ་སློང་ཀུན་དགའ་བོ་དང་ཐབས་ཅིག་ཏུ་བྱང་ཕྱོགས་སུ་གཤེགས་ན་ནི་གདུལ་བ་རྣམས་ཀྱི་དོན་བྱ་དཀའ་བར་འགྱུར་གྱིས།
en: Then the Blessed One thought, “Since I was born in an age of short lifespans, I have come close to the time for nirvāṇa. But there are many things to do for the benefit of people to be trained. If I go to the northern region with the monk Ānanda, it will be difficult to benefit people to be trained.

source: མ་ལ་ང་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་དང་ལྷན་ཅིག་གཤེགས་པར་བྱའོ་སྙམ་ནས།
en: Now I will go with the yakṣa Vajrapāṇi.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཙུག་ལག་ཁང་གི་ཕྱི་རོལ་དུ་ཚིགས་སུ་བཅད་པ་གཉིས་ཀྱིས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་བོས་པ།
en: And so, outside the monastery, the Blessed One summoned the yakṣa Vajrapāṇi with two verses.

source: དྲན་དང་ལྡན་རྣམས་བཟང་པོར་ཤོག །དྲན་དང་ལྡན་རྣམས་རྟག་ཏུ་བཟང་།
en: “May you be excellent, mindful ones. Mindful ones are always excellent.

source: །ཞི་བ་ཐོབ་པའི་སེམས་ཀྱིས་ནི།
en: With the heart that has attained tranquility

source: །དྲན་དང་ལྡན་པ་བདེ་བར་ཉལ།
en: Mindful ones lie in comfort.

source: །དྲན་དང་ལྡན་རྣམས་བཟང་པོར་ཤོག །དྲན་དང་ལྡན་རྣམས་རྟག་ཏུ་བཟང་།
en: “May you be excellent, mindful ones. Mindful ones are always excellent.

source: །རྒྱལ་དང་ཕ་རོལ་རྒྱལ་སྤངས་ནས།
en: Having abandoned both winning and being won by others,

source: །དྲན་དང་ལྡན་པ་བདེ་བར་ཉལ།། །།
en: Mindful ones lie in comfort.”

source: སྤུངས་པ་ཅན་ན་སངས་རྒྱས་སྟོབས།
en: Awakened Power in Heaped Up,

source: །རེ་ཏུ་ཀ་ན་ཆོས་སྟོབས་ཏེ།
en: Dharma Power in Retuka,

source: །སིན་དུ་ན་ནི་ཕོར་ཆེན་ཞབས།
en: Great Cup in the Indus, Feet,

source: །མགོ་རེག་སྤྱི་བླུགས་སོག་མ་མེད།
en: Having a Shaved Head and Water Jar, Apalāla,

source: །ཧུ་ལུ་ཀླུ་དང་དེ་བཞིན་ནགས།
en: The Nāga Huluḍa, and Forest, Bhraṣṭolā, Ṛṣi, Āpannaka,

source: །གཉིད་འགྲོགས་དྲང་སྲོང་ཉམས་པ་དང་། །ཀན་ཐ་འབྲས་ཀྱི་གྲོང་ཁྱེར་དུ།
en: Kanthā, in Dhānyapura

source: །མཆོག་གི་མ་བཏུལ་དབང་ལྡན་རྫ།
en: Converting the Mother of Best Army, The Potter in Naitarī,

source: །གསིང་མའི་གནོད་སྦྱིན་ཆེན་པོ་དང་། །དེ་བཞིན་བརྩེགས་སྐྱོང་དགའ་འཕེལ་དང་། །སྲིད་པའི་ལྷ་དང་གཏུམ་བྱེད་ཀྱི།
en: The Great Yakṣa of Śādvalā, And Pālitakūṭa, Nandivardhana, Bhavadeva, Caṇḍālī’s

source: །བུ་བདུན་རྣམས་ནི་བཏུལ་བ་དང་། །གནོད་སྦྱིན་ཕྱུགས་སྐྱོང་འགྲོ་མགྱོགས་དང་། །ནབ་སོའི་ཀླུ་ལ་གཟུགས་བརྙན་བཏང་།
en: Seven Sons’ Conversion, The Yakṣa Earth-Protector, Giving an Image to Nāgas, Aśvaka and Punarvasuka,

source: །སྦུ་བུ་ཅན་དང་སྦུབས་ཅན་བཏུལ།
en: Converting Nāḍikā and Naḍadaryā,

source: །མདུང་ཅན་གྱི་ནི་གྲོང་ཁྱེར་ན།
en: In the City of Kuntī

source: །མདུང་ཅན་ཞེས་བྱའི་གདོན་སྦྱིན་མོ།
en: the Yakṣiṇī Named Kuntī,

source: །འབྲ་གོ་ཅན་དང་རྡུལ་མཆོད་རྟེན།
en: Kharjūrikā and the Stūpa Made of Dirt.

source: །སོག་མེད་ཚོགས་སུ་བསྡུས་ཏེ་བརྗོད།
en: The story of Apalāla is summarized.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཚུར་བྱང་ཕྱོགས་སུ་ཀླུ་སོག་མ་མེད་འདུལ་དུ་འདོང་ངོ་།
en: The Blessed One then said to the yakṣa Vajrapāṇi, “Vajrapāṇi, let us go to the northern region to convert the nāga Apalāla.”

source: །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏོ།
en: “Certainly, O Honored One,” replied the yakṣa Vajrapāṇi to the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་དང་ཐབས་ཅིག་ཏུ་དེ་ཉིད་ནས་རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་གཤེགས་པ་ན།
en: Thereupon, the Blessed One, along with the yakṣa Vajrapāṇi, flew from there across the sky by means of his magical powers.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱང་རིང་པོ་ཁོ་ན་ཞིག་ན་ཚལ་སྔོ་ཞིང་སྔོ་བ་བསྒྲེངས་པ་དག་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཁྱོད་ཀྱིས་ཚལ་སྔོ་ཞིང་སྔོ་བ་བསྒྲེངས་པ་དག་མཐོང་ངམ།
en: When the Blessed One saw a green forest rising in the distance, he asked the yakṣa Vajrapāṇi, “Vajrapāṇi, do you see that green forest rising?”

source: བཙུན་པ་མཐོང་ལགས་སོ།
en: “Yes, I do, O Honored One.”

source: །དེ་ནི་ཨུ་ཤི་རའི་རི་ཡིན་ཏེ། ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལོ་བརྒྱ་ལོན་པ་ན་ཞི་གནས་དང་རྗེས་སུ་མཐུན་པ་རྣམས་ཀྱི་གནས་མལ་གྱི་མཆོག་ཏ་མ་སའི་ཚལ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: “That is Mount Uśīra. When a hundred years have passed after I am completely emancipated, it will be called Tamasā Forest, the best of the dwelling places that are suited to tranquility.” C. Awakened Power in Heaped Up

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྤུངས་པ་ཅན་དུ་གཤེགས་སོ།
en: Thereupon the Blessed One went to Heaped Up.

source: །དེའི་ཚེ་སྤུངས་པ་ཅན་ན་གནོད་སྦྱིན་སངས་རྒྱས་སྟོབས་ཞེས་བྱ་བ་འདུག་པ་སྡིག་པའི་བསམ་པ་ཅན་ཞིག་གནས་པས་སྤུངས་པ་ཅན་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱིས་མགུ་བར་བྱས་ཀྱང་དེ་དུས་དུས་སུ་གནོད་པ་བྱེད་དོ།
en: There was then a yakṣa of evil disposition named Awakened Power in Heaped Up. Even though people living in Heaped Up pleased him, he occasionally harmed them.

source: །སྤུངས་པ་ཅན་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་སྤུངས་པ་ཅན་དུ་གཤེགས་ནས་ཕྱོགས་ཆེ་གེ་མོ་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ།
en: When the people living in Heaped Up heard that the Blessed One had arrived at Heaped Up and was staying in such-and-such a place, they went to the Blessed One.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་སྤུངས་པ་ཅན་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད་ཅེས་བྱ་བ་ནས་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When they had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, . . . and delighted the people living in Heaped Up . . . the Blessed One remained silent.

source: །དེ་ནས་སྤུངས་པ་ཅན་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་གནོད་སྦྱིན་སངས་རྒྱས་སྟོབས་འདི་བདག་ཅག་ལ་ཡུན་རིང་མོ་ཞིག་ནས་ཤ་ཁོན་མ་མཆིས་པར་ནི་ཤ་ཁོན་བགྱིད། འགྲན་ཟླ་མ་ལགས་པར་ནི་འགྲན་ཟླ་བགྱིད། གླགས་མ་བཙལ་བར་ནི་གླགས་ཚོལ་བར་བགྱིད་ལགས་ན།
en: Thereupon the people living in Heaped Up rose from their seats, draped their upper robes over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “O Honored One, this yakṣa Awakened Power has for a long time been hostile toward us who are not hostile, adversarial toward us who are not adversarial, and injurious to us who have not been injurious.

source: ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་གནོད་སྦྱིན་སངས་རྒྱས་སྟོབས་གདུལ་བར་གསོལ།
en: Alas may the Blessed One have compassion and convert the yakṣa Awakened Power.”

source: དེའི་ཚེ་གནོད་སྦྱིན་སངས་རྒྱས་སྟོབས་འཁོར་དེ་ཉིད་དུ་འདུས་ཤིང་འདུག་པར་གྱུར་ནས།
en: At that time the yakṣa Awakened Power himself was sitting in the assembly.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་སངས་རྒྱས་སྟོབས་ལ་བཀའ་སྩལ་པ། སངས་རྒྱས་སྟོབས་ཁྱོད་ཀྱིས་ཐོས་སམ།
en: The Blessed One then asked the yakṣa Awakened Power, “Awakened Power, did you hear this?”

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཐོས་ལགས་སོ།
en: “O Blessed One, I did.”

source: །སངས་རྒྱས་སྟོབས་ཁྱོད་ཀྱིས་ཐོས་སམ། བདེ་བར་གཤེགས་པ་བདག་གིས་ཐོས་ལགས་སོ།
en: “Awakened Power, did you hear this?” “O Sugata, I did.”

source: །དམ་པ་མ་ཡིན་པའི་ཆོས་སྡིག་པ་དེ་ལས་ལོག་ཤིག །བཅོམ་ལྡན་འདས་བདག་ལྡོག་ལགས་སོ།
en: “Quit this inferior, evil conduct.” “O Blessed One, I will.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་སངས་རྒྱས་སྟོབས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ལ་བཞག་གོ།
en: Then the Blessed One let the yakṣa Awakened Power seek refuge in him and adopt the rules of training.

source: །དེ་ནས་དེས་སྤུངས་པ་ཅན་ཞེས་བྱ་བའི་གནས་མལ་བརྩིགས་སོ།
en: The yakṣa then built a sitting place named Heaped Up.

source: །བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་ཀྱང་ཡོ་བྱད་ཐམས་ཅད་དང་ལྡན་པའི་གཙུག་ལག་ཁང་བརྩིགས་སོ། །བཅོམ་ལྡན་འདས་གཤེགས་པ་དང་གནོད་སྦྱིན་སངས་རྒྱས་སྟོབས་ཞབས་འབྲིང་དུ་ཆས་པ་ལས་བཅོམ་ལྡན་འདས་ཀྱིས་སླར་བཟློག་ནས་བཀའ་སྩལ་པ།
en: Devout brahmins and householders built a monastery provided with all the requisites, too. When the Blessed One departed, the yakṣa Awakened Power followed to serve him.

source: སྐྱེ་བོའི་ཚོགས་འདི་སྲུངས་ཤིག །ངས་ཀྱང་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་ཅི་ནས་སྤྱན་ལྡིངས་ཏེ་འབབ་པར་འགྱུར་བ་དེ་ལྟར་བྱིན་གྱིས་བརླབ་པར་བྱའོ།
en: The Blessed One stopped him and said, “Protect these people. I, too, will make my eyes rise up into the air and descend here by means of my magical power after I am completely emancipated.”

source: །གཞན་དག་གིས་ཀྱང་ཕྱོགས་དེར་མཆོད་རྟེན་བརྩིགས་པས་མཆོད་རྟེན་སྤུངས་པ་ཅན་ཞེས་བྱ་བར་གྲགས་སོ། །རེ་ཏུ་ཀར་བྱོན་ནས།
en: Other people built a stūpa in this place, too, and named it Heaped Up Stūpa. D.

source: རེ་ཏུ་ཀར་གནོད་སྦྱིན་ཆོས་སྟོབས་ཞེས་བྱ་བ་བཏུལ་ཏེ།
en: Dharma Power in Retuka The Blessed One, having arrived in Retuka, converted a yakṣa named Dharma Power there.

source: དེས་རེ་ཏུ་ཀ་ཞེས་བྱ་བའི་གནས་མལ་བརྩིགས་སོ།
en: He also built a dwelling place named Retuka. E. Great Cup in the Indus, Feet

source: །སིན་དུར་གཤེགས་པ་དང་། སིན་དུ་ན་མཉན་པ་གཞན་ཞིག་ཡོད་པ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་དད་པ་བསྐྱེད་དེ།
en: The Blessed One went to the Indus. On the Indus there was a ferryman. He gained faith through a miracle performed by the Blessed One’s magical power.

source: དེ་ནས་དད་པ་སྐྱེས་ནས་བདེན་པ་རྣམས་ལ་བཞག་གོ།
en: Then, faith having arisen in him, he was established in the truths.

source: །གནོད་སྦྱིན་ཕོར་ཆེན་བཏུལ་ནས་ཞབས་ཀྱིས་བཅགས་པས་ཕོར་ཆེན་ཞབས་ཀྱིས་བཅགས་པ་ཞེས་བྱ་བར་གྲགས་སོ།
en: Because the Blessed One, having converted the yakṣa Great Cup, trod on him with his feet, the place was named Great Cup Stepped On with the Feet. F. Having a Shaved Head and Water Jar

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དྲང་སྲོང་རྣམས་ཀྱི་བསྟི་གནས་སུ་གཤེགས་ནས་དེར་དྲང་སྲོང་མགོ་རེག་དང་རིལ་བ་སྤྱི་བླུགས་ཅན་བཏུལ་ནས་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་གནས་མལ་རིལ་བ་སྤྱི་བླུགས་ཅན་ཞེས་བྱ་བ་བརྩིགས་སོ།
en: Thereupon the Blessed One, having gone to the hermitage of ṛṣis, there converted Having a Shaved Head and Water Jar, a ṛṣi. Devout brahmins and householders also built a sitting place named Water Jar. G. Apalāla

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱི་གནས་གང་ན་བ་དེར་འདོང་ངོ་།
en: The Blessed One then said to the yakṣa Vajrapāṇi, “Vajrapāṇi, let us go to the residence of the nāga king Apalāla.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དང་། ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱི་གནས་སུ་གཤེགས་སོ།
en: Thereupon he and the Blessed One went to the residence of the nāga king Apalāla.

source: །ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་གནས་སུ་གཤེགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཁྲོས་འཁྲུགས་རྔམ་ཡི་མ་རངས་ནས་སྟེང་གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ་སེར་བ་དང་རྡུལ་གྱི་ཆར་དབབ་པར་བརྩམས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་འཁྲུགས་སོ་ཞེས་བྱམས་པ་ལ་སྙོམས་པར་ཞུགས་པ་དང་། ཆར་པ་དེ་དག་ཨ་ག་རུའི་ཕྱེ་མ་དང་། ཏ་མ་ལའི་ལོ་མའི་ཕྱེ་མར་གྱུར་ནས་འབབ་པར་བརྩམས་སོ།
en: When the nāga king Apalāla heard that the Blessed One had come to his residence he became so enraged, angry, furious, and displeased that he soared high into the sky and started to cause hail and dust to fall. When the Blessed One, knowing that the nāga was angry, meditated on love, the hail and dust changed, falling as the powder of agaru and the powder of the tamāla leaf.

source: །དེ་ནས་འཁོར་ལོ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་དང་། མདའ་བོ་ཆེ་དང་། མདུང་ཐུང་ལ་སོགས་ཏེ་མཚོན་ཆ་རྣམས་དབབ་པར་བརྩམས་པ་དེ་དག་ཀྱང་ལྷའི་ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བར་གྱུར་ནས་འབབ་པར་བརྩམས་སོ།
en: Then the nāga started to cause weapons such as discuses, single-pointed vajras, lances, and short spears to fall. But they, too, changed, falling as divine utpala, padma, kumuda, puṇḍarīka, and mandārava flowers.

source: །དེ་ནས་སོག་མ་མེད་ཀྱིས་ཁྲོ་བའི་མེས་དུ་བ་དབྱུང་བར་བརྩམས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་རྫུ་འཕྲུལ་གྱིས་དུད་པ་དབྱུང་བར་བརྩམས་སོ།
en: Apalāla then started to emit smoke with the fire of wrath. The Blessed One, too, emitted smoke through his magical power.

source: །དེ་ནས་དེ་སྤུངས་དང་། རྒྱགས་པ་དང་། ང་རྒྱལ་བཅོམ་པར་གྱུར་ནས་གནས་སུ་ཞུགས་ཏེ་འདུག་གོ།
en: Thereupon the nāga, with his power, arrogance, and pride broken, entered his residence and sat down.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། ཀླུ་གདུག་པ་རྣམས་འདུལ་བར་འགྱུར་བ་ནི་རྒྱུ་རྣམ་པ་གཉིས་ཀྱིས་ཏེ།
en: The Blessed One thought, “By two causes are wicked nāgas converted:

source: འཇིགས་པ་དང་། འཁྲུགས་པས་ཡིན་གྱིས།
en: fright and anger.
